# Продовження задач для початківців (самостійне виконання)

# 5. Напишіть функцію для визначення найбільшого з трьох цілих чисел з використанянм вбудованої функції max().

# def max_nums(a, b, c):
#     return a, b, c

# number_1 = int(input("Enter a num1: "))
# number_2 = int(input("Enter a num2: "))
# number_3 = int(input("Enter a num3: "))

# print(max (number_1, number_2, number_3) )

#  ---------

# 6. Напишіть функцію для створення позначок тегів HTML навколо введених рядків. Функція отримує назву тега HTML і рядок, який необхідно помістити у відповідні теги.

# def teg_html (teg, text):
#     return f"<{teg}>{text}</{teg}"

# text = input("Enter text: ")
# teg, string = text.split()

# print(teg_html(teg, string))

# Вхідні дані:

# strong Python
# Вихідні дані:

# <strong>Python</strong>


# 7. Напишіть функцію, яка повертає назву пори року для введеного значення номера місяця.

# 8. Напишіть функцію для створення гістограми (наприклад, у вигляді *) із заданого списку цілих чисел як у вихідних даних. Формат введення списку чисел як у вхідних даних.

# Вхідні дані:

# 2,7,1,4,2,3,9,3
# Вихідні дані:

# **
# *******
# *
# ****
# **
# ***
# *********
# ***


# Middle level 

# 15 У кожної кредитної картки є номер, який надрукований на ній, а також інший номер, вбудований у магнітну стрічку із зворотного боку картки. Цей номер також зберігається у певній базі даних для того, щоб коли вашою карткою розраховуються за покупку, банк знав, з якого рахунку cписувати гроші. У світі багато людей з кредитними картками, і тому ці номери доволі великі: American Express використовує номери із 15 розрядів, MasterCard - з 16, Visa - з 13 або 16. Ці розряди - десяткові (від 0 до 9). Номери кредитних карт мають певну структуру. Номери карток American Express починаються з 34 чи 37; номери карт MasterCard починаються з 51, 52, 53, 54 чи 55 (формально, вони можуть починатись і з деяких інших чисел, але ми не звертатимемо на це уваги в межах нашої задачі); номери карт Visa починаються з 4. Також номери карт мають вбудовану у них контрольну суму, що обраховується за допомогою математичної формули. Тож яка це секретна формула? Більшість карток використовують алгоритм, створений Гансом Петером Луном з IBM (Алгоритм Луна ). Відповідно до цього алгоритму, ви можете перевірити, чи номер кредитної картки є синтаксично коректним, наступним чином. Рядки довжиною 1 або менше не є дійсними. Пропуски дозволені для введення, але їх необхідно видалити перед перевіркою. Усі інші нецифрові символи заборонені.

# Приклад 1: дійсний номер кредитної картки
# 4539 1488 0343 6467
# Перший крок алгоритму Луна - це подвоєння кожної другої цифри, починаючи справа:
# 4_3_ 1_8_ 0_4_ 6_6_
# Якщо подвоєння числа є числом, що перевищує 9, необхідно відняти 9 від добутку.
# Результати нашого подвоєння, розставлені на свої місця:
# 8569 2478 0383 3437
# Далі необхідно підсумувати всі цифри:
# 8+5+6+9+2+4+7+8+0+3+8+3+3+4+3+7 = 80
# Якщо сума націло ділиться на 10, то число дійсне. Цей номер дійсний!  



# Приклад 2: недійсний номер кредитної картки
# 8273 1232 7352 0569
# Подвоєння кожної другої цифри, починаючи справа
# 7253 2262 5312 0539
# Сума цифр
# 7+2+5+3+2+2+6+2+5+3+1+2+0+5+3+9 = 57
# 57 націло не ділиться на 10, тому це число недійсне.  