# String 

#6.	У рядку є кілька слів, розділених одним або декількома пропусками. Потрібно прибрати з тексту зайві пропуски: два і більше пропусків поспіль, а також всі пропуски на початку і в кінці рядка. На вхід програмі подається рядок, що складається не більше ніж з 255 символів. Надрукувати новий рядок.

# Вхідні дані:

#    Beyond the green     swelling hills of the     Mittel Land rose mighty slopes of forest    up    to the lofty steeps of the Carpathians    themselves

# Вихідні дані:

# Beyond the green swelling hills of the Mittel Land rose mighty slopes of forest up to the lofty steeps of the Carpathians themselves

# text = "   Beyond the green     swelling hills of the     Mittel Land rose mighty slopes of forest    up    to the lofty steeps of the Carpathians    themselves"

# text1 = text.split()
# text2 = " ".join(text1)

# print(text2)

# ---------

#8	Дано рядок, що складається з n цифр (тобто одноцифрових чисел), між якими стоїть n-1 знаків операцій, кожна з яких може бути або +, або -. Обчисліть значення цього виразу. Програма має надрукувати результат обчислення цього виразу.

# Вхідні дані:
# 5-3+1
# 6+3-2

# Вихідні дані:
# 3
# 7

# 08.11. ВСПОМНИТЬ ХОТЬ ОДИН ВАРИАНТ ПОСЛЕ ПОВТОРА ЗАВТРА 09.11

# 8.2 Variant

# task = input("Enter a task: ") 
# sum = int(task[0]) # беремо перший символ у рядку, якій дорівнює 5

# for i in range(1, len(task), 2): # перебираємо математичні знаки + та -, які стоять на і-му місці
#     sum += (1 if task [i] == "+" else -1) * int(task[i+1])

# print(sum)

# На виході: 
# Enter a task: 6+3-2
# 7

# 09.11. Смешалось два варианта 2 и 3, исправила, перенос на след строчку забыла \n 

# ---------

#09.11. 07:38 

#9 Напишіть програму, на вхід якої даються чотири числа a, b, c і d, кожне у своєму рядку. Програма повинна вивести фрагмент таблиці множення для всіх чисел відрізка [a; b] на всі числа відрізка [c; d]. Числа a, b, c і d є натуральними і не перевищують 10, a ≤ b, c ≤ d. Дотримуйтесь формату виведення як у вихідних даних. Для поділу елементів всередині рядка використовуйте \t - символ табуляції. Зауважте, що лівим стовпчиком і верхнім рядком виводяться самі числа із заданих відрізків.

# Вхідні дані:
# 1
# 4
# 2
# 5

# Вихідні дані:
#    2	3	4	5
# 1  2	3	4	5
# 2	 4	6	8	10
# 3	 6	9	12	15
# 4	 8	12	16	20

a = int(input("Enter a number1:\n ")) # діапазон множення від а до b
b = int(input("Enter a number2:\n ")) # діапазон множення від а до b
c = int(input("Enter a number3:\n ")) # діапазон множення від c до d
d = int(input("Enter a number4:\n ")) # діапазон множення від c до d

print("     ", end="\t") # пишемо цифри діапазону c до d
for j in range(c, d + 1): # проходимо по діапазону від c до d
    print(j, end="\t")
print() 

for i in range(a, b + 1): # проходимо по діапазону від a до b
    print(i, end="\t")
    for j in range(c, d + 1): # проходимо по діапазону від c до d
        print(i * j, end="\t") # множимо і виводимо

    print() # перехід на новий рядок після кожного рядка

# ДРУК
# Enter a number1:
#  1
# Enter a number2:
#  4
# Enter a number3:
#  2
# Enter a number4:
#  5
#         2       3       4       5
# 1       2       3       4       5
# 2       4       6       8       10
# 3       6       9       12      15
# 4       8       12      16      20
