#12.Напишіть програму для обчислення добутку цілих чисел (без використання циклу for), які вводяться через пропуск користувачем в одному рядку.

# 12.1 var
# numbers = list(map(int, input("Enter list: ").split())) #кожний елемент списку розбили на цифри

# result = 1 #додаткова змінна, до якої буде запамятовуватися результат
# # цифра 1 не змінює добуток

# for n in numbers: #по кождному з елементу списку n=2,друге повторювання n=3 та n=5ю Після першого проходження result буде 2*1=2; після другого проходження result буде 2*5=10 
#     result *= n

# print(result)
# ------------

# 2 variant

# numbers = list(map(int, input("Enter list: ").split()))
# n = 0
# result = 1
# while n < len(numbers): # n буде запамятовувати індекси
#     result *=numbers[n]
#     n += 1

# print(result)



# Вхідні дані:

# 2 5 3
# Вихідні дані:

# 30

#16 Напишіть програму для видалення кожного третього елемента із цілочисельного списку і друку результуючого списку, доки список не стане порожнім. Початковий список цілих чисел вводиться в одному рядку через пропуск.

# Вхідні дані:

# 2 5 8 9 4 78 7 1
# Вихідні дані:

# [2, 5, 9, 4, 78, 7, 1]
# [2, 5, 4, 78, 7, 1]
# [2, 5, 78, 7, 1]
# [2, 5, 7, 1]
# [2, 5, 1]
# [2, 5]
# [5]
# []