# (1, "a", 2.0)
# list()

# 1 Створіть список на основі введеної послідовності цілих чисел і надрукуйте другу половину списку. Якщо кількість не парна, то вивести більшу кількість.

# value = "1 5 6 4 8 87 43 43 98" 
# value_list = list(map(int,value.split()))
# print(value_list[len(value_list)//2:])

# 2. Створіть список на основі введеної послідовності цілих чисел і надрукуйте його елементи таким чином: два останні елементи переміщені з кінця в початок списку без зміни їх початкового порядку.

# value = "1 5 6 4 8 87 43 43 98" 
# value_list = list(map(int, value.split()))
# v_l2 = value_list[:-2]
# v_l1 = value_list[-2:]

# print (v_l1)

#3. Збережіть назви мов світу, які вводяться в одному рядку через пропуск, у списку. Простежте за тим, щоб елементи у списку не зберігались в алфавітному порядку. Відсортуйте список в алфавітному порядку і виведіть його елементи в рядку через пропуск.

# languages = "Ukrainian Romanian German English"
# language_list = languages.split()
# language_list.sort()
# print(" ".join(language_list))
