# Сума двох чисел: Написати програму, яка зчитує два цілих числа та виводить їх суму.
# n1 = int(input("Enter number1: "))
# n2 = int(input("Enter number2: "))
# print(n1 + n2)

# Гіпотенуза: За двома катетами прямокутного трикутника знайти довжину його гіпотенузи.
# n3 = float(input("Enter number1: "))
# n4 = float(input("Enter number2: "))
# print(((n3) ** 2) + ((n4) ** 2) ** 0.5)

# Двічі: Написати програму, яка зчитує ціле число та виводить його двічі.
# n5 =input("Number5")
# print (n5, n5)

# Привіт, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить привітання.
# n6 = input("Ваше ім'я? ")
# print("Привіт, ", n6)

# # Прощавай, <ім'я>: Написати програму, яка запитує ім'я користувача і виводить прощання.
# n7 = input("Ваше ім'я? ")
# print("Прощавай, ", n7)
