# 11. Напишіть програму для знаходження коренів квадратного рівняння a*x2 + b*x + c = 0. Користувач вводить значення коефіцієнтів a, b, c. У вхідних даних наведено три пари вхідних значень коефіцієнтів, а у вихідних даних - відповідні повідомлення про кількість коренів або їх відсутність.
# Вхідні дані:
# 8
# 4
# 2
# 3.6
# 10
# -3
# 2
# 4
# 2

# Вихідні дані:
# No roots.
# 0.27 and -3.05
# -1.00


# a = float(input("Enter a num1: ")) # time 2:18 Praxis-Lektion 7
# b = float(input("Enter a num2: "))
# c = float(input("Enter a num3: "))

# print (f"Дано кваратне рівняння {a}x2 + {b}x + c")

# d = b ** 2 - 4 * a * c

# if d < 0:
#     print("No roots")
# elif d == 0:
#     x = (-b) / (2 * a)
#     print("The root is one: x=", x)
# else:
#     x1 = (-b - d ** 0.5) / (2 * a)
#     x2 = (-b + d ** 0.5) / (2 * a)
#     print(f"x1 = {x1}, x2 = {x2}")

# -----------------
# 1. Виведіть повідомлення Hello, Python! на екран n разів (n - ціле число, яке вводить користувач).

# n = int(input("Enter number: "))
# for i in range(n):
#     print("Hello, Python!")

    # print(i) for exemple

 # (5) -> 0,1,2,3,4
# (1,5)  -> 1,2,3,4
# (start,stop)

# (1,5,2) -> 1,3 (5,1,-2) -> 5,3
# 2 - Step¸

# 2. Дано два цілих числа a і b (a ≤ b). Виведіть всі числа від a до b включно.


# a = int(input("a: "))
# b = int(input("b: "))

# if a > b:
#     a, b = b, a
# #                       b + 1 ->
# for i in range(a, b + 1): 
#     print(i)

#  -----------------
#3 Напишіть програму-таймер зворотного відліку, яка запитує у користувача кількість секунд n, з якої слід починати відлік.

# n = int(input("Enter sec: "))  # Time 10:28

# for 



#     print("Start!")       

# n = int(input("Enter sec: "))
# while n > 0:
#     print(n) 
#     n -= 1 # n = n - 1 

# print("Start!")

#  -----------

# 8. Намалювати сходинки як у вихідних даних, використовуючи символи пропуску і решітки #, коли на вхід програми подається ціле число n - кількість сходинок.

# n = int(input("Count: "))

# for el in range(1, n+1):
#         print("#" * el)

# n = int(input("Count: ")) ступеньки в обратном порядке
# while n > 0:
#     print("#" * n)
#     n -= 1 # n = n - 1 

# Вхідні дані:
# 4
# Вихідні дані:

#
##
###
####

#  ---------

# 9. За даним цілим додатнім числом n обчисліть n! - значення факторіалу цього числа.

# Факторіал: n! = 1 * 2 * 3 * ... * (n-1) * n

# n = int(input("Count: "))

# f = 1

# for i in range(1, n+1):
#     print(f)
#     f *= i
# print(f)


# ----------------
