# Hard level

#17 Користувач вводить два цілих додатних числа n і m. Напишіть програму, яка створює двовимірний масив розміром n x m і заповнює його символами . і * у шаховому порядку (як у вихідних даних). Лівий верхній кут повинен мати символ ..

# Вхідні дані:

# 6 8

# . * . * . * . *
# * . * . * . * .
# . * . * . * . *
# * . * . * . * .
# . * . * . * . *
# * . * . * . * .

#---------

# n = int(input("n: "))
# m = int(input("m: "))

# for row in range(n):
#     for col in range(m):
#         print(row, col)

# (ВЫВОД В ДВЕНАДЦАТЬ РЯДКОВ ПО ДВА СТОЛБИКА)

# --------------------

# n = int(input("n: "))
# m = int(input("m: "))

# for row in range(n):         # проходить по диапазону от 0 до (n-1)
#     for col in range(m):     # проходить по диапазону от 0 до (m-1)
#         if (row + col) % 2 == 0: # определяет парность
#             print(".", end=" ")
#         else:
#             print("*", end=" ")
#         # print(col, end=" ")  # выводить один рядок
#     print()
    # print("\n") # вывод 3 на 4 в массив

# (ВЫВОД: В ТРИ РЯДА ПО ЧЕТЫРЕ СТОЛБИКА)

# ---------

#20
# n x m

# n = int(input("n: "))
# m = int(input("m: "))

# result = [] # пустой список
# # m_list = []

# for row in range(n):         # проходить по диапазону от 0 до (n-1)
#     m_list = [] # создай пустой список
#     for col in range(m):     # проходить по диапазону от 0 до (m-1)  - наполняет ряд или точкой или звездочкой
#         if (row + col) % 2 == 0: # определяет парность
#             # print(".", end=" ")
#             m_list.append(".")
#         else:
#             # print("*", end=" ")
#             m_list.append(".") # наполнение внутреннего списка
#         # print(col, end=" ")  # выводить один рядок
#     result.append(m_list) # наполненный список, есть один список, в кот. еще есть один "точка, зведочка, точка"

#     # print()
# print(result)